import math


def area(r):
    '''Вычисляет площадь круга по заданному радиусу
       Параметр:
         r (float): длина радиуса
       Возвращаемое значение:
         float: площадь круга
       Пример вызова:
         circle area(4)
    '''
    return math.pi * r * r


def perimeter(r):
    '''Вычисляет длину окружности по заданному радиусу
       Параметр:
         r (float): длина радиуса
       Возвращаемое значение:
         float: длина окружности
       Пример вызова:
         circle perimeter(4)
    '''
    return 2 * math.pi * r

