def area(a, b):
    '''Вычисляет площадь прямоугольника по длине и ширине
       Параметры:
         a (float): длина прямоугольника
         b (float): ширина прямоугольника
       Возвращаемое значение:
         float: площадь прямоугольника
       Пример вызова:
         rectangle area(4, 9)
    '''
    if a < 0 or b < 0:
        raise ValueError("Стороны не могут быть отрицательными")
    return a * b

def perimeter(a, b):
    '''Вычисляет периметр прямоугольника по длине и ширине
        Параметры:
          a (float): длина прямоугольника
          b (float): ширина прямоугольника
        Возвращаемое значение:
          float: периметр прямоугольника
        Пример вызова:
          rectangle perimeter(4, 9)
        '''
    if a < 0 or b < 0:
        raise ValueError("Стороны не могут быть отрицательными")
    return 2 * (a + b)
