
def area(a):
    '''Вычисляет площадь квадрата по длине его стороны
        Параметр:
          a (float): длина стороны квадрата
        Возвращаемое значение:
          float: площадь квадрата
        Пример вызова:
          square area(8)
    '''
    if a < 0:
        raise ValueError("Сторона не может быть отрицательной")
    return a * a


def perimeter(a):
    '''Вычисляет периметр квадрата по длине его стороны
        Параметр:
          a (float): длина стороны квадрата
        Возвращаемое значение:
          float: периметр квадрата
        Пример вызова:
          square perimeter(8)
    '''
    if a < 0:
        raise ValueError("Сторона не может быть отрицательной")
    return 4 * a
