def area(a, h):
    '''Вычисляет площадь треугольника по длине основания и высоте.
        Параметры:
          a (float): длина основания
          h (float): длина высоты
        Возвращаемое значение:
          float: площадь треугольника
        Пример вызова:
          triangle area(5, 2)
    '''
    if a < 0 or h < 0:
        raise ValueError("Основание и высота не могут быть отрицательными")
    return a * h / 2

def perimeter(a, b, c):
    '''Вычисляет периметр треугольника по длинам трех сторон.
        Параметры:
          a (float): длина первой стороны
          b (float): длина второй стороны
          c (float): длина третьей стороны
        Возвращаемое значение:
          float: периметр треугольника
        Пример вызова:
          triangle perimeter(3, 3, 5)
    '''
    if a < 0 or b < 0 or c < 0:
        raise ValueError("Стороны не могут быть отрицательными")
    return a + b + c
